#pragma once

#include <windows.h>
#include <string>
#include <vector>
#include <atlstr.h>

/*
Основная функция программы. В качестве аргумента принимает масив команд для запуска процессов.
Елементами масива могут быть :
1.		командой Windows
2.		адрес исполняемого файла процесса

После запуска всех переданныхъ процессов, выполняется обработка введенных команд пользователя, через консоль программы.
После завершения программы выполняется очистка памяти.
*/
int _tmain(int, _TCHAR * []);
/*
Функция для создание процесса, при создании процеса указатель на структуру процеса '_Process' записывается в вектор 'proc_list'
Аргументы :
_TCHAR*		1.	может быть командой Windows с передаваемыми параметрами (например cmd, notepad, calc)
			2.	может быть местить адрес к файлу процесса
			*/
void Create_Process(_TCHAR*);
/*
Функция выводит список всех зарегистрированых в программе процесоов и информацию про них:
1.	Название процесса
2.	ID процеса в списке процессов
3.	Статус процесоов
		NULL	-	процесс не запущен
		RUNING	-	процесс выполняется
		*/
void Print_List(void);
