#pragma once

#include <windows.h>
#include <iostream>
#include <string>
#include <vector>
#include <sstream>

/*
Функция для считывания введенной пользователем информации в консоль.
Возвращает масив введенных слов
*/
std::vector<std::string> Get_Input(void);

/*
Функция для проверки существования файла
*/
int File_Exists(_TCHAR*);
/*
Функция разбивает строку текста на подстроки, разделенные символом
Возвращает масив строк.
*/
std::vector<std::string> split(const std::string&, char);
/*
Выводит в окно программы список всех доступных, для пользователя команд
*/
void Print_Help(void);
/*
Выводит в окно программы сообщение об не правильно введенных данных
*/
void Print_Error(void);
/*
Фукция которая обьеденяет все слова в масиве (кроме первого) в одну строчку, через пробел
Используется для формулирования команд Windows, которые состоят с нескольких слов (например: команда и передаваемые аргументы)
*/
std::string Get_String(std::vector<std::string>);